export const _http =
  'http://192.168.0.110:8906/BplusDvSvr/BplusErpDvSvrIIS.dll/';
export const API_ENDPOINT =
  'http://203.150.55.21:8891/BplusNotiService/BplusNotiIIS.dll/';
export const BPLUS_APPID = 'cdaa9350-cb32-416e-a85b-6ecedd81ebdf';
export const PROJECT_ID = '{6E1D6A9C-540D-454C-9e28-B259F24C95FA}';
export const NTFU_SVID = '{9c6dd907-45ba-43ec-872b-69b928e64be2}';
export const SERVICE_ID = '{167f0c96-86fd-488f-94d1-cc3169d60b1a}';
export const USERNAME_SERVICE = 'BUSINESS';
export const PASSWORD_SERVICE = 'SYSTEM';
export const TERM_CONDITION =
  'ข้อกำหนดและเงื่อนไข : สำหรับสมาชิก Bplus Member\r\n\r\n\r\nเงื่อนไขของสมาชิกบีพลัส เมมเบอร์ (ต่อไปนี้จะเรียกว่า "เงื่อนไขการให้บริการ") เป็นข้อตกลงระหว่างบริษัท ตัวอย่างโปรแกรม อี-บิซิเนส พลัส จํากัด ซึ่งต่อไปนี้ จะเรียกว่า "บริษัท" ฝ่ายหนึ่ง กับการลงทะเบียนสมัครสมาชิกบัตรบีพลัส เมมเบอร์ กับบริษัท ซึ่งต่อไปเรียกว่า "สมาชิก" อีกฝ่ายหนึ่งเพื่อสมาชิกสามารถสะสมแต้มผ่านบัตรสมาชิกบีพลัส เมมเบอร์ โดยเงื่อนไขการให้สิทธิประโยชน์ของบริษัทอาจมีลักษณะกระทบสิทธิของสมาชิก ซึ่งสมาชิกควรอ่านและทําความเข้าใจอย่างละเอียด หากมีข้อสงสัยเกี่ยวกับบริการของบริษัทสมาชิกสามารถติดต่อสอบถามทางบริษัทได้โดยทันที โดยรายละเอียดข้อกำหนดและเงื่อนไขมีดังต่อไปนี้ \r\n\r\n1. คำนิยาม\r\n\r\n\r\n\r\n"สมาชิก" หมายความว่า สมาชิกบีพลัส เมมเบอร์ "ข้อมูลส่วนบุคคล" หมายความว่า ข้อมูลเกี่ยวกับบุคคลซึ่งทำให้สามารถระบุตัวบุคคลนั้นได้ไม่ว่าทางตรงหรือทางอ้อม\r\n\r\n2. การเปิดเผยข้อมูล\r\n\r\n\r\n\r\n2.1 สมาชิกตกลงและยินยอมให้บริษัทเก็บรวบรวมข้อมูลส่วนบุคคล ซึ่งรวมถึงแต่ไม่จำกัดอยู่เพียงข้อมูลทางชีวภาพ (Biometrics Data) ข้อมูลทางการเงิน หรือข้อมูลใด ๆ ของสมาชิกที่ได้ให้ไว้แก่บริษัท และ/หรือที่อยู่ในความครอบครองของบริษัท และ/หรือที่บริษัทเก็บรวบรวมจากแหล่งอื่นหรือบุคคลอื่นใดโดยถูกต้องตามกฎหมายที่ใช้บังคับอยู่ในขณะนั้น (ซึ่งต่อไปนี้จะเรียกรวมว่า "ข้อมูล") และยินยอมให้บริษัทใช้, ส่ง, โอน, ประมวลผล และ/หรือเปิดเผยข้อมูลให้แก่บริษัท ตัวอย่างโปรแกรม อี-บิซิเนส พลัส จํากัด และ/หรือบริษัทในเครือของบริษัทดังกล่าวทั้งหมดข้างต้น (ซึ่งต่อไปนี้จะเรียกรวมว่า "บริษัทในเครือธุรกิจ") รวมถึงผู้สอบบัญชี ผู้ตรวจสอบภายนอกของบริษัท หน่วยงานราชการ ผู้รับโอนสิทธิเรียกร้อง และ/หรือนิติบุคคล หรือบุคคลอื่นใด ๆ ที่บริษัทเป็นคู่สัญญาหรือมีความสัมพันธ์ด้วย ทั้งภายใน และภายนอกประเทศ เพื่อวัตถุประสงค์ในการเก็บรวบรวม, ใช้, เปิดเผย, ประมวลผล, วิเคราะห์ข้อมูล, ยืนยัน/พิสูจน์ตัวตน และ/หรือปรับปรุงบริการ หรือผลิตภัณฑ์ต่าง ๆ ของบริษัท หรือของบุคคลดังกล่าว, เพื่อปฎิบัติตามสัญญาซึ่งสมาชิกเป็นคู่สัญญา, เพื่อดำเนินการตามคำขอของสมาชิกก่อนเข้าทำสัญญานั้น, เพื่อปฎิบัติตามสัญญาระหว่างบริษัทกับบุคคลอื่นอันเป็นประโยชน์ของสมาชิก, เพื่อตรวจสอบรายการธุรกรรมที่อาจจะเกิดการทุจริต, เพื่อวัตถุประสงค์อื่นใดที่ไม่ต้องห้ามตามกฎหมาย และ/หรือเพื่อปฏิบัติตามกฎหมาย หรือกฎระเบียบของประเทศใด ๆ ที่ใช้บังคับกับบริษัท หรือบุคคลดังกล่าว โดยความยินยอมดังกล่าวข้างต้นทั้งหมดให้มีอยู่ตลอดระยะเวลาที่ผู้ใช้บริการยังคงมีบัญชีอยู่กับบริษัท \r\n\r\n2.2 สมาชิกยินยอมให้บริษัทและบริษัทในเครือธุรกิจ ส่งข้อมูลข่าวสารแก่สมาชิกได้ เพื่อนำเสนอข่าวสาร, กิจกรรมทางการตลาด, รายการส่งเสริมการขาย, แคมเปญ หรือนำเสนอผลิตภัณฑ์ต่าง ๆ ที่เป็นประโยชน์ให้แก่สมาชิกได้ และสมาชิกรับทราบว่า สมาชิกสามารถบอกเลิก หรือปฏิเสธการรับข้อมูลข่าวสารดังกล่าวได้ตามช่องทางที่บริษัทกำหนด \r\n\r\n2.3 สมาชิกตกลงยินยอมให้บริษัทในเครือธุรกิจ รวมถึงธนาคาร และหน่วยงานราชการที่ครอบครองข้อมูลของสมาชิก เปิดเผยข้อมูลของสมาชิกซึ่งให้ไว้แก่บริษัทดังกล่าวกับบริษัท เพื่อตรวจสอบและยืนยันข้อมูลส่วนบุคคลของสมาชิก, เพื่อรับข้อมูลหรือข่าวสาร, เพื่อวัตถุประสงค์ทางการตลาดและการส่งเสริมการขาย, เพื่อการเสนอสิทธิประโยชน์ และ/หรือเสนอขายสินค้าหรือบริการใดๆ, เพื่อประโยชน์ในการให้บริการหรือการทำธุรกรรมทางการเงิน, เพื่อการสถิติ, วิเคราะห์, ศึกษาวิจัย หรือประเมินผล ข้อมูล หรือเพื่อวัตถุประสงค์อื่นใดที่ไม่ต้องห้ามตามกฎหมาย \r\n\r\n2.4 สมาชิกมีสิทธิดังต่อไปนี้ \r\n\r\n2.4.1 ขอเข้าถึงข้อมูลของตนเองซึ่งอยู่กับบริษัท หรือขอให้เปิดเผยถึงการได้มาซึ่งข้อมูลที่ตนไม่ได้ให้ความยินยอม \r\n\r\n2.4.2 ขอให้บริษัทลบ หรือทำลาย ระงับการใช้ชั่วคราว หรือแปลงข้อมูลส่วนบุคคลให้อยู่ในรูปแบบข้อมูลที่ไม่สามารถรู้ตัวบุคคลที่เป็นเจ้าของข้อมูลได้ ในกรณีที่บริษัทไม่ปฏิบัติตามกฎหมายที่เกี่ยวข้องกับการคุ้มครองข้อมูล \r\n\r\n2.4.3 ขอให้บริษัทดำเนินการแก้ไขหรือเพิ่มเติมให้ข้อมูลถูกต้อง เป็นปัจจุบัน สมบูรณ์ และไม่ก่อให้เกิดความเข้าใจผิด\r\n\r\n3. สิทธิประโยชน์\r\n\r\n\r\n\r\nข้าพเจ้าสมาชิกตกลงและยอมรับว่าสิทธิประโยชน์ที่บริษัทเสนอให้แก่สมาชิกแต่ละรายอาจแตกต่างกัน ขึ้นอยู่กับประวัติการซื้อสินค้าของสมาชิกแต่ละราย รายการโปรโมชั่นสินค้าแต่ละประเภท และ/หรือ นโยบายทางการตลาดของบริษัท\r\n\r\n4. การคืนสินค้า และ/หรือ แต้มสะสม\r\n\r\n\r\n\r\n4.1 ข้าพเจ้าสมาชิกตกลงและยอมรับว่า หากข้าพเจ้าคืนสินค้า ข้าพเจ้าต้องคืนแต้มสะสมที่ได้รับจากสินค้าที่คืนนั้น รวมทั้งของพรีเมียมซึ่งแลกรับมาจากแต้มสะสมไปก่อนแล้วนั้นแก่บริษัท โดยหากไม่สามารถส่งคืนของพรีเมียมในสภาพที่สมบูรณ์ได้ ข้าพเจ้าตกลงคืนเป็นเงินสดตามมูลค่าของพรีเมียมแทน \r\n\r\n4.2 ข้าพเจ้าตกลงและยอมรับว่า หากข้าพเจ้าใช้แต้มสะสมของข้าพเจ้าเพื่อเป็นส่วนลดในการซื้อสินค้าจากร้านค้าตามที่บริษัทกำหนด แล้วมีการคืนสินค้าบางรายการจากการชำระเงินในครั้งดังกล่าว ข้าพเจ้าจะไม่ได้รับแต้มสะสมที่ใช้เป็นส่วนลดแทนเงินสดในครั้งนั้นคืน\r\n\r\n5. การสะสมแต้ม จากการชำระค่าสินค้า และ/หรือ บริการ\r\n\r\n\r\n\r\n5.1 ข้าพเจ้าสมาชิกตกลงและยอมรับว่าการสะสมแต้มในบัตรต้องแสดงความเป็นสมาชิกบีพลัส เมมเบอร์ ณ จุดให้บริการที่บริษัทกำหนดเท่านั้น \r\n\r\n5.2 ข้าพเจ้าสมาชิกตกลงและยอมรับว่า การสะสมแต้มจากการชำระค่าสินค้าและ/หรือบริการ เป็นไปตามรายการโปรโมชั่นสินค้าแต่ละประเภทที่บริษัทกำหนด และ/หรือนโยบายทางการตลาดของบริษัท\r\n\r\n6. การแลกหรือรับสิทธิประโยชน์\r\n\r\n\r\n\r\nข้าพเจ้าสมาชิกตกลงและยอมรับว่า ข้าพเจ้าจะต้องแสดงบัตรทุกครั้งก่อนการแลกหรือรับสิทธิประโยชน์ใดๆ จากบริษัท โดยหากมีการแสดงบัตรหลังจากที่ธุรกรรมใดๆ ได้ดำเนินการไปแล้ว ข้าพเจ้ายินยอมที่จะสละสิทธิประโยชน์ดังกล่าว\r\n\r\n7. อายุการใช้งานของบัตร\r\n\r\n\r\n\r\n7.1 สมาชิกไม่มีกำหนดอายุการใช้งาน สมาชิกสามารถตรวจสอบแต้มสะสมได้ที่ใบเสร็จรับเงินของร้าน Bplus  \r\n\r\n7.2 แต้มสะสมของบัตรมีอายุ 2 ปีนับแต่วันที่ได้รับแต้ม โดยระบบจะตัดแต้มในวันที่ 31 ธันวาคม เวลา 23.59 นาฬิกา ของปีที่แต้มครบอายุที่กำหนด\r\n\r\n8. การต่ออายุบัตร\r\n\r\n\r\n\r\nข้าพเจ้าสมาชิกตกลงและยอมรับว่า บริษัทจะให้สิทธิ์ในการเปลี่ยนบัตรใหม่แก่ข้าพเจ้าตามเงื่อนไขที่บริษัทกำหนด\r\n\r\n9. บัตรถูกขโมย หรือสูญหาย\r\n\r\n\r\n\r\n9.1 บัตรถูกขโมยหรือสูญหาย บริษัทตกลงจะทำการคืนแต้มสะสมให้ต่อเมื่อข้าพเจ้าได้มีการแจ้งความร้องทุกข์ต่อพนักงานสอบสวน และได้แจ้งความจำนงขอออกบัตรใหม่กับบริษัท พร้อมทั้งแสดงบันทึกประจำวันแจ้งความร้องทุกข์ โดยข้าพเจ้าตกลงชำระค่าธรรมเนียมในการออกบัตรตามที่บริษัทกำหนด \r\n\r\n9.2 หากบัตรถูกขโมยหรือสูญหายเกิดขึ้นจากการกระทำทุจริตใดๆ ของข้าพเจ้าหรือที่ข้าพเจ้ายินยอมให้ผู้อื่นกระทำการดังกล่าว บริษัทปฏิเสธไม่รับผิดชอบชดใช้แต้ม รวมทั้งสิทธิประโยชน์ใดๆ ที่จัดเก็บอยู่ในบัตรคืนให้กับข้าพเจ้า\r\n\r\n10. บัตรชำรุด\r\n\r\n\r\n\r\n10.1 กรณีบัตรชำรุดที่อยู่ในความรับผิดชอบของบริษัทดังต่อไปนี้ บริษัทจะดำเนินการออกบัตรใหม่ให้ โดยสมาชิกไม่ต้องชำระค่าธรรมเนียมในการออกบัตรใหม่ \r\n\r\n10.1.1 บัตรที่ไม่สามารถเปิดใช้ได้ในครั้งแรก ณ จุดขาย \r\n\r\n10.1.2 บัตรที่ผ่านการตรวจสอบจากบริษัทแล้วพบว่าเป็นความชำรุดบกพร่องอันเกิดจากขั้นตอนการผลิต \r\n\r\n10.1.3 บัตรชำรุดภายใน 15 วันนับจากวันเปิดใช้บริการบัตรครั้งแรก โดยที่การชำรุดนั้นมิได้เกิดจากเหตุภายนอกหรือ\tการกระทำของผู้ถือบัตรเองไม่ว่าจงใจหรือประมาทเลินเล่อ ทั้งนี้ สมาชิกต้องทำการติดต่อบริษัทเพื่อทำการเปลี่ยน\tบัตรใหม่ \r\n\r\n10.2 กรณีบัตรชำรุดที่บริษัทสงวนสิทธิ์การรับผิดชอบดังต่อไปนี้ หากสมาชิกประสงค์ที่จะใช้บริการบัตรดังกล่าว สมาชิกจะต้องขอออกบัตรใหม่และชำระค่าธรรมเนียมในการออกบัตรให้แก่บริษัท \r\n\r\n10.2.1 บัตรชำรุดหลังจาก 15 วันนับจากวันที่มีการเปิดใช้บริการบัตรครั้งแรก \r\n\r\n10.2.2 บัตรชำรุดจนไม่อาจเรียกหรืออ่านข้อมูลใดๆ จากหน้าบัตรหรือจากฐานระบบของบริษัท หรือไม่อาจพิสูจน์ได้\tว่าเป็นบัตรของบริษัท \r\n\r\n10.3 บริษัทจะทำการโอนสิทธิประโยชน์จากระบบฐานข้อมูลของบริษัทเข้าบัตรใหม่ให้แก่สมาชิกที่ชำรุดทุกกรณี\r\n\r\n11. การยกเลิก\r\n\r\n\r\n\r\nข้าพเจ้าสมาชิกตกลงและยอมรับว่า บริษัทมีสิทธิ์ปฏิเสธการสมัครนี้ โดยไม่ต้องส่งคืนเอกสารแก่ข้าพเจ้า หรือสามารถยกเลิกสมาชิกได้ โดยไม่จำเป็นต้องระบุสาเหตุการปฏิเสธ/ยกเลิกดังกล่าว\r\n\r\n12. กรณีข้อโต้แย้ง หรือทุจริต\r\n\r\n\r\n\r\n12.1 กรณีที่มีข้อโต้แย้งเกี่ยวกับแต้มจากการเป็นสมาชิก ข้าพเจ้าตกลงและยอมรับให้บริษัทมีอำนาจในการตรวจสอบและปรับแต้มย้อนหลังได้ไม่เกิน 6 เดือน และการตัดสินของบริษัทถือเป็นที่สุด \r\n\r\n12.2 กรณีพบว่ามีการฉ้อฉล ปลอมแปลง หรือการกระทำทุจริตใดๆ เพื่อให้ได้มาซึ่งแต้มสะสม เพื่อแลกรับของพรีเมียม และ/หรือ สินค้า และ/หรือบริการต่างๆ ไม่ว่าจะเป็นเพียงบางส่วนหรือทั้งหมดของข้าพเจ้าหรือที่ข้าพเจ้ายินยอมให้ผู้อื่นกระทำการข้างต้น ข้าพเจ้าตกลงและยอมรับว่า บริษัทมีสิทธิ์ปฏิเสธการโอนสิทธิประโยชน์ของสมาชิก\r\n\r\n13. การเปลี่ยนแปลง แก้ไข เพิ่มเติม\r\n\r\n\r\n\r\n13.1 ข้าพเจ้าสมาชิกตกลงและยอมรับผูกพันตามข้อกำหนดและเงื่อนไขของการเป็นสมาชิกที่บริษัทกำหนดไว้ขณะที่แจ้งขอสมัครสมาชิก และรวมถึงการเปลี่ยนแปลงแก้ไขที่อาจมีขึ้นในภายหน้า โดยบริษัทมิต้องแจ้งให้ทราบล่วงหน้า \r\n\r\n13.2 ข้าพเจ้าสมาชิกตกลงและยอมรับว่า บริษัทมีสิทธิ์ในการเปลี่ยนแปลงเงื่อนไขของสมาชิก การแลก ของ พรีเมียม และสิทธิประโยชน์ สิทธิพิเศษต่างๆ โดยมิต้องแจ้งให้ข้าพเจ้าทราบล่วงหน้า กรณีที่มีปัญหาขัดแย้ง คำชี้ขาดของบริษัทถือเป็นที่สิ้นสุด\r\n\r\n14. ค่าธรรมเนียมบัตร\r\n\r\n\r\n\r\n14.1 บัตรไม่มีค่าธรรมเนียมในการออกบัตร เว้นแต่เป็นกรณีบัตรถูกขโมยหรือสูญหายตามข้อ 9 และกรณีบัตรชำรุดที่บริษัทสงวนสิทธิ์การรับผิดชอบตามข้อ 10.2 ผู้ถือบัตรต้องชำระค่าธรรมเนียมในการออกบัตรใหม่ 50 บาท \r\n\r\n14.2 บริษัทสงวนสิทธิ์ในการเปลี่ยนแปลงอัตราค่าธรรมเนียม โดยจะมีการแจ้งให้ข้าพเจ้าทราบล่วงหน้าก่อนการเปลี่ยนแปลง\r\n\r\n15. ทรัพย์สินทางปัญญา\r\n\r\n\r\n\r\nข้าพเจ้าสมาชิกทราบว่าทรัพย์สินทางปัญญา ซึ่งมีอยู่บนแถบแม่เหล็กในบัตรเป็นกรรมสิทธิ์ของบริษัท โดยห้ามมิให้ข้าพเจ้าโอน อนุญาต ลอกเลียน หรืออนุญาตให้บุคคลอื่นนำสิทธิดังกล่าวไปใช้ในทางอื่นใด นอกเหนือจากการใช้เพื่อประโยชน์ของการใช้บัตรเท่านั้น หากมีการฝ่าฝืนกระทำการดังกล่าว บริษัทมีสิทธิที่จะดำเนินการตามกฏหมายกับผู้ที่กระทำการละเมิดสิทธิ์ในทรัพย์สินทางปัญญาของบริษัท\r\n\r\n16. เหตุฉุกเฉิน/ข้อร้องเรียน\r\n\r\n\r\n\r\nกรณีมีเหตุฉุกเฉินหรือข้อร้องเรียนเกี่ยวกับบริการ สามารถแจ้งได้ที่ศูนย์บริการสมาชิกที่เบอร์ 02-880-8800 (ในเวลาทำการ) หรือ www.businessplus.co.th';

//logout
export const SIGNOUT_REQUEST = 'SIGNOUT_REQUEST';

//user
export const ACTION_USER_DATA = 'ACTION_USER_DATA';
export const ACTION_USER_HTTP = 'ACTION_USER_HTTP';
//Register
export const ACTION_SET_FIRSTNAME = 'ACTION_SET_FIRSTNAME';
export const ACTION_SET_LASTNAME = 'ACTION_SET_LASTNAME';
export const ACTION_SET_NAMETITLE = 'ACTION_SET_NAMETITLE';
export const ACTION_SET_BIRTHDATE = 'ACTION_SET_BIRTHDATE';
export const ACTION_SET_PHONENUM = 'ACTION_SET_PHONENUM';
export const ACTION_SET_SEX = 'ACTION_SET_PASSWORD';
export const ACTION_SET_ADDR_1 = 'ACTION_SET_ADDR_1';
export const ACTION_SET_ADDR_2 = 'ACTION_SET_ADDR_2';
export const ACTION_SET_ADDR_3 = 'ACTION_SET_ADDR_3';
export const ACTION_SET_POSTCODE = 'ACTION_SET_POSTCODE';
export const ACTION_SET_EMAIL = 'ACTION_SET_EMAIL';
export const ACTION_SET_PASSWORD = 'ACTION_SET_PASSWORD';
export const ACTION_LOGIN = 'ACTION_LOGIN';
export const ACTION_USERLOGIN = 'ACTION_USERLOGIN';

export const ACTION_SET_MACHINENUM = 'ACTION_SET_MACHINENUM';
export const ACTION_M_PINCODE = 'ACTION_M_PINCODE';
//addbase
export const ACTION_DATA = 'ACTION_DATA';
//Login
export const ACTION_SET_GUID = 'ACTION_SET_GUID';
export const ACTION_SET_JSONRESULT = 'ACTION_SET_JSONRESULT';
export const ACTION_SET_SERVICEID = 'ACTION_SET_SERVICEID';
export const ACTION_SET_USERNAMESER = 'ACTION_SET_USERNAMESER';
export const ACTION_SET_PASSWORDSER = 'ACTION_SET_PASSWORDSER';
export const LOGIN_SET_USERNAME = 'LOGIN_SET_USERNAME';
export const LOGIN_SET_PASSWORD = 'LOGIN_SET_PASSWORD';
export const ACTION_SET_PROJECTID = 'ACTION_SET_PROJECTID';
export const ACTION_SET_INDEX = 'ACTION_SET_INDEX';
export const ACTION_SET_IP_ADDRESS = 'ACTION_SET_IP_ADDRESS';
export const ACTION_SET_FINGERPRINT = 'ACTION_SET_FINGERPRINT';
export const ACTION_SET_SCREEN = 'ACTION_SET_SCREEN';

//Redeem
export const ACTION_SET_GETLO_GUID = 'ACTION_SET_GETLO_GUID';
export const ACTION_SET_GETLO_NAME = 'ACTION_SET_GETLO_NAME';
export const ACTION_SET_GETLO_RESULT = 'ACTION_SET_GETLO_RESULT';
export const ACTION_SET_GETPAGE_GUID = 'ACTION_SET_GETPAGE_GUID';
export const ACTION_SET_GETPAGE_NAME = 'ACTION_SET_GETPAGE_NAME';
export const ACTION_SET_GETPAGE_RESULT = 'ACTION_SET_GETPAGE_RESULT';

//Activity
export const ACTION_ACT_GETLO_GUID = 'ACTION_ACT_GETLO_GUID';
export const ACTION_ACT_GETLO_NAME = 'ACTION_ACT_GETLO_NAME';
export const ACTION_ACT_GETLO_RESULT = 'ACTION_ACT_GETLO_RESULT';
export const ACTION_ACT_GETPAGE_GUID = 'ACTION_ACT_GETPAGE_GUID';
export const ACTION_ACT_GETPAGE_RESULT = 'ACTION_ACT_GETPAGE_RESULT';
export const ACTION_ACT_GETCON_NAME = 'ACTION_ACT_GETCON_NAME';
export const ACTION_ACT_GETCON_RESULT = 'ACTION_ACT_GETCON_RESULT';
export const ACTION_ACT_GETCON_LASTUPDATE = 'ACTION_ACT_GETCON_LASTUPDATE';

//
export const PROMO_ACT_GETLO_SPAGE = 'PROMO_ACT_GETLO_SPAGE';
export const PROMO_ACT_GETLO_PAGE = 'PROMO_ACT_GETLO_PAGE';
export const PROMO_ACT_GETLO_INFO = 'PROMO_ACT_GETLO_INFO';
export const PROMO_ACT_GETCON_LASTUPDATE = 'PROMO_ACT_GETCON_LASTUPDATE';

//Notification
export const ACTION_NOTI_GETLO_GUID = 'ACTION_NOTI_GETLO_GUID';
export const ACTION_NOTI_GETLO_NAME = 'ACTION_NOTI_GETLO_NAME';
export const ACTION_NOTI_GETLO_RESULT = 'ACTION_NOTI_GETLO_RESULT';
export const ACTION_NOTI_GETPAGE_GUID = 'ACTION_NOTI_GETPAGE_GUID';
export const ACTION_NOTI_GETPAGE_STATUS = 'ACTION_NOTI_GETPAGE_STATUS';

//contactUS
export const ACTION_CONU_GETLO_GUID = 'ACTION_CONU_GETLO_GUID';
export const ACTION_CONU_GETLO_NAME = 'ACTION_CONU_GETLO_NAME';
export const ACTION_CONU_GETLO_RESULT = 'ACTION_CONU_GETLO_RESULT';
export const ACTION_CONU_GETPAGE_GUID = 'ACTION_CONU_GETPAGE_GUID';
export const ACTION_CONU_GETPAGE_NAME = 'ACTION_CONU_GETPAGE_NAME';
export const ACTION_CONU_GETPAGE_RESULT = 'ACTION_CONU_GETPAGE_RESULT';

//interest.img
export const ACTION_IMG_INTEREST = 'ACTION_IMG_INTEREST';

//campaign
export const ACTION_CAM_GETLO_GUID = 'ACTION_CAM_GETLO_GUID';
export const ACTION_CAM_GETLO_NAME = 'ACTION_CAM_GETLO_NAME';
export const ACTION_CAM_GETLO_RESULT = 'ACTION_CAM_GETLO_RESULT';
export const ACTION_CAM_GETPAGE_GUID = 'ACTION_CAM_GETPAGE_GUID';
export const ACTION_CAM_GETPAGE_NAME = 'ACTION_CAM_GETPAGE_NAME';
export const ACTION_CAM_GETPAGE_RESULT = 'ACTION_CAM_GETPAGE_RESULT';
